# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/bundle'

# Install apps (casks) (ps. i hate quarantine and that stupid little popup like please shut up)
cask '1password', args: { no_quarentine: true }
cask 'raycast', args: { no_quarentine: true }
cask 'visual-studio-code', args: { no_quarentine: true }
cask 'brave-browser', args: { no_quarentine: true }
cask 'discord', args: { no_quarentine: true }
cask 'docker', args: { no_quarentine: true }
cask 'figma', args: { no_quarentine: true }
cask 'alt-tab', args: { no_quarentine: true }
cask 'stats', args: { no_quarentine: true }
cask 'calibre', args: { no_quarentine: true }
cask 'boop', args: { no_quarentine: true }
cask 'fl-studio', args: { no_quarentine: true }
cask 'minecraft', args: { no_quarentine: true }
cask 'qbittorrent', args: { no_quarentine: true }
cask 'vlc', args: { no_quarentine: true }
cask 'qbittorrent', args: { no_quarentine: true }
cask 'the-unarchiver', args: { no_quarentine: true }

# Install cli tools
brew 'rename'
brew 'ripgrep'
brew 'rustscan'
brew 'curl'
brew 'wget'
brew 'tree'
brew 'sl'
brew 'unar'
brew 'yt-dlp'
brew 'megatools'
brew 'starship'
brew 'zoxide'
brew 'git'
brew 'git-lfs'
brew 'rtx'
brew 'gh'